// Мне в этом проэкте нравмтся только main. Mod server и client представляют сз себя большой спагетти код.
// Необходимо создать два "Класса" сервер и клиент. Логику h2, handle нового клиента и handle нового сообщения
// вынести в отдельные структуры, реалезовать для них trait Tower.
// Логирование необходимо выделить в отдельный код, для сервера и клиента реалезовать middleware.
// Посмотреть в сторону crates логирования, например traising.

// Мне хотелось реалеховать клиент-серверную архитектуру именно с использование назкоуровневых crates. Мне нравиться эта "наивная" реалезация!)

// Я решил вынесть серверную и клиентскую чать кода в отдельные модули. Подумал что так код станет выглядить чище:
mod client;
mod server;

// Объявим crates, которые я буду использовать в этом тэстовом приложении:
use structopt::StructOpt;

// Определим структуру с trait StructOpt, она поможет нам понять с какой ролью мы запустили наше приложение:
#[derive(Debug, StructOpt)]
#[structopt(about = "Тестовое Client/Server приложение")]
enum Opt {
    Server(server::ServerOpt),
    Client(client::ClientOpt),
}

// Оприделим функцию main с использованиям макроса #[toki::main], main добжна быть async:
#[tokio::main]
async fn main() {
    match Opt::from_args() {
        Opt::Server(opt) => server::run(opt).await,
        Opt::Client(opt) => client::run(opt).await,
    };
}
